{
  "education": [
    {
      "awards_achievements": [
        "McMaster Entrance Scholarship"
      ],
      "degree": "Bachelor of Electrical Engineering",
      "department": "Electrical and Computer Engineering",
      "duration": "2017-2023",
      "school_name": "McMaster University"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_Ayodele",
  "highlighted_projects": [
    {
      "description": "Developed a React-Native based autonomous-plant caretaker application to monitor indoor plants, IOT sensors tracked light, water tank level, temperature, moisture and soil nutrition. Ensured clarity of metrics by performing end-to-end REST API testing (Postman, JSON), ensuring hardware sensor to back-end and then to front end data synchronization. ",
      "git_url": "https://github.com/Plant-Monitor/Plant-Monitor-App",
      "name": "Autonomous Plant Tracker"
    },
    {
      "description": "Currently developing bug tracker application to create, read, update and data logs of bugs for a development team. Back-end developed using Express, Node and Mongoose and MongoDB for database management and data collection. ",
      "name": "Bug Tracker"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Created a monitoring agent to monitor the computer hardware usage of a cluster. The data was stored serially in a PSQL database on a docker container. Linux/Bash scripts were used to automate hardware information retrieval, and real-time database updates.",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    }
  ],
  "name": "Ayodele Ajimoko",
  "others": [
    {
      "bullets": [
        "Singer/Songwriter",
        "Music Producer"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Developed montiroring agent to monitor computer hardware usage of clusters. Stored data serially in PSQL database on a docker container. Automated data input serially using bash/linux scripts. ",
      "duration": "March 2024-present",
      "title": "Software Developer"
    },
    {
      "company": "Avanade",
      "description": "Collaborated with UI/UX designers, stakeholders and software engineers to document and implement upgrades of front-end web components of user's bank checking and savings accounts (JavaScript, Vue.js). Fixed conditional rendering defects to ensure high-quality user experience with banking system software (JIRA used for ticket updates) ",
      "duration": "May 2022 - Aug 2022",
      "title": "Software Developer Intern"
    },
    {
      "company": "MHIRJ",
      "description": "Improved data reporting workflow, reduced time spent by 60% by VBA automating budget, overhead costs, forecast, P\u0026L, and revenue excel dashboards for the Customer and Product Support (CPS) team.Streamlined operations by organizing monthly business review meetings for the CPS team, involving business analysts, managers, and senior directors. Managed project timelines through daily task monitoring and weekly project completion performance, enhancing the reporting of CPS team's financial progress. Enhanced interpretation of financial data by providing KPI insights through weekly financial reports and data visualization for all groups under the internal CPS team, weekly sent to the Senior Director and quarterly to the Vice President of MHI RJ. ",
      "duration": "June 2020 - Aug 2021",
      "title": "Project Coordinator and Reporting Analyst"
    }
  ],
  "skills": {
    "competent": [
      "C++",
      "C",
      "PostMan",
      "Ember.js",
      "JQuery",
      "VBA"
    ],
    "familiar": [
      "Linux/Bash",
      "MongoDB",
      "RDMBS/SQL",
      "Express.js",
      "Mongoose"
    ],
    "proficient": [
      "Java",
      "Python",
      "Javascript",
      "React.js",
      "Agile/Scrum",
      "Git",
      "OOP (Object oriented Programming)",
      "Vue.js",
      "Figma"
    ]
  },
  "summary": "My name is Ayodele Ajimoko and I am a recent Electrical Engineering graduate from McMaster University with 1 year and 4 months of project coordination and financial reporting analysis experience at MHIRJ and 4 months of software development internship experience at Avanade. I am passionate about full stack software development with a back-end focus  and I have done multiple projects showcasing my skills and knowledge."
}
